; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v5)
             (pred_3 ?v9 ?v7)
             (pred_11 ?v10 ?v7)
             (pred_1 ?v11 ?v10 )
	     (pred_5 ?v10)
             (pred_4 ?v6)
             (pred_6 ?v9)
             (pred_7 ?v7)
             (pred_10 ?v10)
             (pred_9 ?v9)
             (pred_12 ?v10)
             (pred_8 ))



(:action op_4
:parameters (?v8 ?v4 ?v3 ?v12)
:precondition (and (pred_4 ?v8) (pred_4 ?v4) (pred_6 ?v3) (pred_7 ?v12)
          (pred_2 ?v8 ?v4) (pred_3 ?v3 ?v12)
                   (pred_11 ?v4 ?v12) (pred_5 ?v8) 
                   (pred_10 ?v4) (pred_9 ?v3))
:effect (and  (pred_12 ?v4) (not (pred_10 ?v4))))


(:action op_1
:parameters (?v8 ?v2)
:precondition (and (pred_4 ?v8) (pred_4 ?v2)
               (pred_5 ?v8) (pred_2 ?v8 ?v2) (pred_12 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v8))))

(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_4 ?v8) (pred_6 ?v3) 
                  (pred_5 ?v8) (pred_1 ?v3 ?v8) (pred_8 ))
:effect (and (pred_9 ?v3)
   (not (pred_1 ?v3 ?v8)) (not (pred_8 ))))


(:action op_3
:parameters (?v8 ?v1 ?v13)
:precondition (and (pred_4 ?v8) (pred_6 ?v1) (pred_6 ?v13)
                  (pred_5 ?v8) (pred_9 ?v13) (pred_1 ?v1 ?v8))
:effect (and (pred_9 ?v1) (pred_1 ?v13 ?v8)
        (not (pred_9 ?v13)) (not (pred_1 ?v1 ?v8))))

(:action op_2
:parameters (?v8 ?v3)
:precondition (and (pred_4 ?v8) (pred_6 ?v3) 
                  (pred_5 ?v8) (pred_9 ?v3))
:effect (and (pred_8 ) (pred_1 ?v3 ?v8) (not (pred_9 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_09 obj_03 obj_19 obj_02 obj_06 obj_18 obj_01 obj_04 obj_07 obj_13 obj_10 obj_12 obj_16 obj_14 obj_11
    obj_15 obj_08
    obj_05 obj_17
    )

    (:init
       (pred_8)

       (pred_4 obj_20)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_4 obj_18)
       (pred_4 obj_01)
       (pred_4 obj_04)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_17)

       (pred_2 obj_20 obj_02)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_20)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_03 obj_19)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_19 obj_03)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_06 obj_18)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_18 obj_13)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_18)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_14 obj_16)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_11 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_10)
       (pred_11  obj_20 obj_15)
       (pred_11  obj_10 obj_08)
       (pred_12 obj_09)
       (pred_12 obj_03)
       (pred_12 obj_19)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_18)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_12 obj_07)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_16)
       (pred_12 obj_14)
       (pred_12 obj_11)

       (pred_3  obj_05 obj_15)
       (pred_3  obj_17 obj_08)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_17 obj_01)
       (pred_5 obj_12)
    )

    (:goal (and
       (pred_1 obj_17 obj_10)
    ))
(:constraints
  (always (not (pred_5 obj_18)))
)
)

; plan
1. (op_1 obj_12 obj_04)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_04)
   goals met: 0 of 1
2. (op_1 obj_04 obj_02)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_06)
   goals met: 0 of 1
4. (op_1 obj_06 obj_09)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_09)
   goals met: 0 of 1
5. (op_1 obj_09 obj_03)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_03)
   goals met: 0 of 1
6. (op_1 obj_03 obj_19)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_19)
   goals met: 0 of 1
7. (op_1 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 0 of 1
8. (op_5 obj_01 obj_17)
   deleted: (pred_1 obj_17 obj_01) (pred_8)
   added: (pred_9 obj_17)
   goals met: 0 of 1
9. (op_4 obj_01 obj_10 obj_17 obj_08)
   deleted: (pred_10 obj_10)
   added: (pred_12 obj_10)
   goals met: 0 of 1
10. (op_1 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 0 of 1
11. (op_2 obj_10 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_8) (pred_1 obj_17 obj_10)
   goals met: 1 of 1
